Repository: fise13/AutoCore
Catalog: AutoCore/Resources/Localization/Localizable.xcstrings
Source language: en
Languages: ru

# app_state.database_open_failed_format
source: Could not open the database: %@
ru: Не удалось открыть базу данных: %@

# app.database_error_title
source: Database error
ru: Ошибка базы данных

# common.add
source: Add
ru: Добавить

# common.cancel
source: Cancel
ru: Отмена

# common.system_user
source: System
ru: Система

# database.readonly_access_errors
source: The database is open read-only due to access errors.
ru: База данных открыта только для чтения из-за ошибок доступа.

# ios.create_manually
source: Create manually
ru: Создать вручную

# ios.creating_accounting
source: Setting up your accounting…
ru: Создаём вашу бухгалтерию…

# ios.ensure_company_failed
source: Could not set up accounting
ru: Не удалось создать бухгалтерию

# ios.loading
source: Loading…
ru: Загрузка…

# ios.loading_data
source: Loading data…
ru: Загрузка данных…

# ios.retry
source: Retry
ru: Повторить

# login.apple_error_format
source: Apple sign-in error: %@
ru: Ошибка входа через Apple ID: %@

# login.choose_sign_in
source: Choose a sign-in method
ru: Выберите удобный способ входа

# login.confirm_password
source: Confirm password
ru: Повторите пароль

# login.create_account
source: Create an account
ru: Создайте аккаунт

# login.have_account_sign_in
source: Already have an account? Sign in
ru: Уже есть аккаунт? Войти

# login.no_account_register
source: No account? Register
ru: Нет аккаунта? Регистрация

# login.or_email
source: or with email
ru: или по email

# login.password
source: Password
ru: Пароль

# login.passwords_mismatch
source: Passwords do not match
ru: Пароли не совпадают

# login.sign_in
source: Sign in
ru: Войти

# login.sign_in_google
source: Sign in with Google
ru: Войти через Google

# login.sign_up
source: Sign up
ru: Зарегистрироваться

# menu.add_motor
source: Add motor
ru: Добавить мотор

# menu.duplicate
source: Duplicate
ru: Дублировать

# menu.export_excel
source: Export Excel
ru: Экспорт Excel

# menu.export_to_excel
source: Export to Excel
ru: Экспорт в Excel

# menu.import_excel
source: Import Excel
ru: Импорт Excel

# menu.import_from_excel
source: Import from Excel
ru: Импорт из Excel

# menu.mark_sold
source: Mark as sold
ru: Пометить как проданный

# menu.motors
source: Motors
ru: Моторы

# menu.new_motor
source: New motor
ru: Новый мотор

# menu.redo
source: Redo
ru: Повторить

# menu.tester_panel
source: Tester panel
ru: Панель тестировщика

# menu.undo
source: Undo
ru: Отменить

# nav.accounting
source: Accounting
ru: Бухгалтерия

# nav.all_motors
source: All motors
ru: Все моторы

# nav.sold
source: Sold
ru: Проданные

# nav.warehouse
source: Warehouse
ru: Склад

# onboarding.company_name
source: Company name
ru: Название компании

# onboarding.company_name_placeholder
source: Enter company name
ru: Введите название

# onboarding.continue
source: Continue
ru: Продолжить

# onboarding.create
source: Create
ru: Создать

# onboarding.create_company
source: Create company
ru: Создать компанию

# onboarding.done
source: Done
ru: Готово

# onboarding.have_invite_code
source: I have an invite code
ru: У меня есть код приглашения

# onboarding.subtitle
source: Create a company or join an existing one with an invite code.
ru: Создайте компанию или присоединитесь к существующей по коду приглашения.

# onboarding.welcome
source: Welcome
ru: Добро пожаловать

# recovery.database_open_failed_format
source: Could not open the database: %@
ru: Не удалось открыть базу данных: %@

# recovery.database_validation_failed_format
source: Database validation error: %@
ru: Ошибка валидации базы данных: %@

# recovery.migration_failed_format
source: Database migration error: %@
ru: Ошибка миграции базы данных: %@

# recovery.operation_blocked_format
source: Operation blocked in recovery mode. %@
ru: Операция заблокирована в режиме восстановления. %@

# role.accountant
source: Accountant
ru: Бухгалтер

# role.admin
source: Administrator
ru: Администратор

# role.employee
source: Employee
ru: Сотрудник

# role.owner
source: Owner
ru: Владелец

# role.viewer
source: Viewer
ru: Наблюдатель

# root.batch_note_message
source: The note will be appended to existing notes for the selected motors.
ru: Заметка будет добавлена к существующим заметкам выбранных моторов

# root.batch_note_placeholder
source: Note text
ru: Текст заметки

# root.batch_note_title_format
source: Add note to %lld motors
ru: Добавить заметку к %lld моторам

# root.brand_not_found_duplicate
source: Could not find brand to duplicate.
ru: Не удалось найти бренд для дублирования

# root.category_not_found_message
source: The category was removed or does not exist.
ru: Категория была удалена или не существует

# root.category_not_found_title
source: Category not found
ru: Категория не найдена

# root.choose_excel_file
source: Choose Excel file
ru: Выберите Excel файл

# root.create_category_error_format
source: Could not create category: %@
ru: Ошибка создания категории: %@

# root.engine_not_found_duplicate
source: Could not find engine to duplicate.
ru: Не удалось найти двигатель для дублирования

# root.export_error_format
source: Export error: %@
ru: Ошибка экспорта: %@

# root.export_excel
source: Export Excel
ru: Экспорт Excel

# root.export_single_motor_placeholder
source: Single-motor export will be available in a future version.
ru: Экспорт одного мотора будет реализован в следующей версии

# root.export_single_motor_title
source: Export motor
ru: Экспорт мотора

# root.motor_duplicated
source: Motor duplicated successfully.
ru: Мотор успешно продублирован

# root.no_data_to_export
source: No data to export
ru: Нет данных для экспорта

# root.recovery_mode
source: Recovery mode
ru: Режим восстановления

# root.update_error_format
source: Update error: %@
ru: Ошибка при обновлении: %@

# root.warehouse_unavailable_message
source: Could not determine the user’s company.
ru: Не удалось определить компанию пользователя

# root.warehouse_unavailable_title
source: Warehouse unavailable
ru: Склад недоступен

# root.window_not_found
source: Could not find the application window.
ru: Не удалось найти окно приложения

# sidebar.all_brands
source: All brands
ru: Все бренды

# sidebar.brands
source: Brands
ru: Бренды

# sidebar.new_category_help
source: New category
ru: Новая категория

# sidebar.no_categories
source: No categories
ru: Нет категорий

# sidebar.specific_section
source: Specific
ru: Специфичные

# tester.brands
source: Brands
ru: Бренды

# tester.by_category
source: By category:
ru: По категориям:

# tester.cancel
source: Cancel
ru: Отмена

# tester.clear_entire_database
source: Clear entire database
ru: Очистить всю базу данных

# tester.close
source: Close
ru: Закрыть

# tester.confirm_clear_button
source: Clear everything
ru: Очистить всё

# tester.confirm_clear_message
source: This removes all local data for this account. This cannot be undone.
ru: Будут удалены все локальные данные для этого аккаунта. Действие необратимо.

# tester.confirm_clear_title
source: Clear all data?
ru: Очистить все данные?

# tester.copy_stats
source: Copy statistics
ru: Скопировать статистику

# tester.create_backup
source: Create backup
ru: Создать резервную копию

# tester.data_cleanup
source: Data cleanup
ru: Очистка данных

# tester.database_stats
source: Database statistics
ru: Статистика базы данных

# tester.delete_all_brands
source: Delete all brands
ru: Удалить все бренды

# tester.delete_all_engines
source: Delete all engines
ru: Удалить все двигатели

# tester.delete_all_motors
source: Delete all motors
ru: Удалить все моторы

# tester.delete_all_specific_categories
source: Delete all specific categories
ru: Удалить все специфичные категории

# tester.delete_all_specific_records
source: Delete all specific records
ru: Удалить все специфичные записи

# tester.delete_old_service_records
source: Delete legacy service records
ru: Удалить старые записи обслуживания

# tester.engines
source: Engines
ru: Двигатели

# tester.error.backup_format
source: Backup failed: %@
ru: Ошибка создания резервной копии: %@

# tester.error.company_required
source: Sign in with a company to migrate.
ru: Укажите компанию (войдите в систему с компанией).

# tester.error.delete_format
source: Delete failed: %@
ru: Ошибка удаления: %@

# tester.error.migration_format
source: Migration failed: %@
ru: Ошибка миграции: %@

# tester.error.optimize_format
source: Optimization failed: %@
ru: Ошибка оптимизации: %@

# tester.error.stats_format
source: Could not load statistics: %@
ru: Ошибка получения статистики: %@

# tester.export.stats_not_loaded
source: Statistics not loaded.
ru: Статистика не загружена.

# tester.firestore_migration
source: Firestore migration
ru: Миграция в Firestore

# tester.firestore_migration_hint
source: Upload all local financial operations to Firestore for the current company.
ru: Выгрузить все локальные финансовые операции в Firestore (для текущей компании).

# tester.migrate_operations
source: Migrate operations to Firestore
ru: Мигрировать операции в Firestore

# tester.motors
source: Motors
ru: Моторы

# tester.optimize_database
source: Optimize database
ru: Оптимизировать базу данных

# tester.refresh_stats
source: Refresh statistics
ru: Обновить статистику

# tester.service_records
source: Service records
ru: Записи обслуживания

# tester.sold_motors
source: Sold motors
ru: Проданные моторы

# tester.specific_categories
source: Specific categories
ru: Специфичные категории

# tester.specific_data
source: Specific data
ru: Специфичные данные

# tester.specific_records_new
source: Specific records (new)
ru: Специфичные записи (новые)

# tester.success.backup_created_format
source: Backup created: %@
ru: Резервная копия создана: %@

# tester.success.brands_deleted
source: All brands removed.
ru: Все бренды удалены.

# tester.success.database_cleared
source: Local database cleared.
ru: Вся база данных очищена.

# tester.success.engines_deleted
source: All engines removed.
ru: Все двигатели удалены.

# tester.success.migration_done_format
source: Migration finished: %lld of %lld operations uploaded to Firestore.
ru: Миграция завершена: %lld из %lld операций выгружено в Firestore.

# tester.success.motors_deleted
source: All motors removed.
ru: Все моторы удалены.

# tester.success.optimized
source: Database optimized.
ru: База данных оптимизирована.

# tester.success.service_records_deleted
source: All legacy service records removed.
ru: Все старые записи обслуживания удалены.

# tester.success.specific_categories_deleted
source: All specific categories removed.
ru: Все специфичные категории удалены.

# tester.success.specific_records_deleted
source: All specific records removed.
ru: Все специфичные записи удалены.

# tester.tap_refresh_stats
source: Tap “Refresh statistics” to load.
ru: Нажмите «Обновить статистику», чтобы загрузить данные.

# tester.utilities
source: Utilities
ru: Утилиты

# tester.window_title
source: Tester panel
ru: Панель тестировщика
